Revit 2024 API
RebarRoundingManager.ApplicableReinforcementRoundingSource Property
 Identifies the source of the rounding settings for this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ReinforcementRoundingSource ApplicableReinforcementRoundingSource { get; }
Visual Basic
Public ReadOnly Property ApplicableReinforcementRoundingSource As ReinforcementRoundingSource
	Get
Visual C++
public:
property ReinforcementRoundingSource ApplicableReinforcementRoundingSource {
	ReinforcementRoundingSource get ();
}
Remarks
 For a Rebar or RebarInSystem element, this could be Rebar, RebarType, or ReinforcementSettings. For a RebarType, this could be RebarType or ReinforcementSettings.
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace